app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "mih julius ndim "], ["email", "mihndim2016@gmail.com"], ["password", "xxxxxx"], ["created_at", "2021-04-13 09:55:51.679427"], ["updated_at", "2021-04-13 09:55:51.679427"]]
---
  def create
    @user = User.new(username: params[:username], email: params[:email], password: params[:password])
   # @user = User.new(user_params)

    if @user.save